In [4]:
import os
import numpy as np
import pandas as pd
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [9]:
datapath = "Cust_Segmentation.csv"
df = pd.read_csv(datapath)

In [10]:
df.head()

,Customer Id,Age,Edu,Years Employed,Income,Card Debt,Other Debt,Defaulted,Address,DebtIncomeRatio
0,1,41,2,6,19,0.124,1.073,0.0,NBA001,6.3
1,2,47,1,26,100,4.582,8.218,0.0,NBA021,12.8
2,3,33,2,10,57,6.111,5.802,1.0,NBA013,20.9
3,4,29,2,4,19,0.681,0.516,0.0,NBA009,6.3
4,5,47,1,31,253,9.308,8.908,0.0,NBA008,7.2

In [12]:
df_cust = df[['Years Employed', 'DebtIncomeRatio']]
df_cust

     Years Employed  DebtIncomeRatio
0                 6              6.3
1                26             12.8
2                10             20.9
3                 4              6.3
4                31              7.2
..              ...              ...
845               5              6.8
846               7              7.0
847               0             33.4
848              12              2.9
849              16              8.6

[850 rows x 2 columns]

In [13]:
df_cust.describe()

       Years Employed  DebtIncomeRatio
count      850.000000       850.000000
mean         8.565882        10.171647
std          6.777884         6.719441
min          0.000000         0.100000
25%          3.000000         5.100000
50%          7.000000         8.700000
75%         13.000000        13.800000
max         33.000000        41.300000

In [14]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Years Employed   850 non-null    int64
 1   DebtIncomeRatio  850 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 13.4 KB

In [17]:
df_cust['Years Employed'].value_counts()

Years Employed
0     72
1     59
4     57
6     53
9     52
3     50
2     50
5     49
7     45
10    38
8     38
12    38
16    33
11    32
13    32
15    23
18    22
19    17
14    16
17    14
22    13
21    10
20     7
23     6
24     5
25     4
31     3
27     3
30     3
29     2
33     2
26     1
28     1
Name: count, dtype: int64

In [18]:
df_cust['DebtIncomeRatio'].value_counts()

DebtIncomeRatio
5.4     12
5.0     10
4.5     10
6.7     10
4.4     10
        ..
18.3     1
23.4     1
25.4     1
19.7     1
33.4     1
Name: count, Length: 245, dtype: int64

In [19]:
df_cust.isnull().sum()

Years Employed     0
DebtIncomeRatio    0
dtype: int64